Tekla Open API Reference for Tekla Structures 2025
StructuresFieldAttribute Class
 The StructuresFieldAttribute class is used for mapping a database attribute to a data field that the plug-in uses in execution. The attribute is initialized from the custom attribute [StructuresField(attributeName)] in the plug-in source. In the plug-in the data field must be public and the type must be double, integer or string.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.StructuresFieldAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class StructuresFieldAttribute : Attribute
Public NotInheritable Class StructuresFieldAttribute
	Inherits Attribute
The StructuresFieldAttribute type exposes the following members.
Constructors
Name | Description
StructuresFieldAttribute
 The custom attribute [StructuresField(attributeName)] uses this to map a database attribute to a data field that the plug-in uses in execution. This is not to be used by itself.
Top
Properties
Name | Description
AttributeName
 The name of the attribute.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace